In [70]:
# Persiapan membuat data
import pandas as pd
import random

pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']

hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis_kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random.choice(kelas) for i in range(20)]
}

df = pd.DataFrame(hasil_nilai)
display(df)

    siswa_id   pelajaran  nilai jenis_kelamin kelas
0          1      Fisika     15     laki-laki   12C
1          2     Biologi     16     laki-laki   12C
2          3     Geologi     56     perempuan   12D
3          4     Biologi      2     laki-laki   12D
4          5  Matematika     84     perempuan   12C
5          6     Geologi     87     perempuan   12B
6          7       Kimia     88     perempuan   12B
7          8     Ekonomi     24     laki-laki   12C
8          9       Kimia      5     laki-laki   12C
9         10     Ekonomi     45     laki-laki   12D
10        11     Biologi     23     laki-laki   12B
11        12      Fisika     89     perempuan   12B
12        13     Ekonomi     12     perempuan   12B
13        14     Ekonomi     21     laki-laki   12D
14        15     Geologi     95     laki-laki   12C
15        16     Geologi     54     perempuan   12D
16        17      Fisika     74     laki-laki   12B
17        18      Fisika      8     laki-laki   12C
18        19      Fisika     99     perempuan   12D
19        20       Kimia     65     laki-laki   12D

In [71]:
# <h2>Soal 1: Indexing</h2>

# 1. Lakukan indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
# 2. Lakukan indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai
# jawab
col_kelas=df.loc[0:,['nilai','kelas']]
display(col_kelas)
baris_5_10=df.iloc[5:11,[1,2]]
display(baris_5_10)

    nilai kelas
0      15   12C
1      16   12C
2      56   12D
3       2   12D
4      84   12C
5      87   12B
6      88   12B
7      24   12C
8       5   12C
9      45   12D
10     23   12B
11     89   12B
12     12   12B
13     21   12D
14     95   12C
15     54   12D
16     74   12B
17      8   12C
18     99   12D
19     65   12D

   pelajaran  nilai
5    Geologi     87
6      Kimia     88
7    Ekonomi     24
8      Kimia      5
9    Ekonomi     45
10   Biologi     23

In [67]:
# <h2>Soal 2: Filter DataFrame Dengan Boolean</h2>

# 1. Tampilkan semua data siswa pada mata pelajaran Ekonomi dan Fisika
# 2. Tampilkan semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia 
# 3. Tampilkan semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C
matkul_eko=df.pelajaran=='Ekonomi'
matkul_Fis=df.pelajaran=='Fisika'
display(df[(matkul_eko | matkul_Fis)])
matkul_kim=df.pelajaran=='Kimia'
nilai_lebih=df.nilai > 50
display(df[matkul_kim & nilai_lebih])
nilai_lebih_70=df.nilai>70
cewek=df.jenis_kelamin=='perempuan'
kelas=df.kelas=='12C'
display(df[(nilai_lebih_70 & (cewek & kelas))])

    siswa_id pelajaran  nilai jenis_kelamin kelas
2          3    Fisika     44     laki-laki   12A
7          8    Fisika     57     laki-laki   12A
8          9   Ekonomi      1     perempuan   12C
13        14   Ekonomi     37     laki-laki   12A
17        18   Ekonomi     63     laki-laki   12C
18        19    Fisika     55     perempuan   12B

    siswa_id pelajaran  nilai jenis_kelamin kelas
14        15     Kimia     99     laki-laki   12D

Empty DataFrame
Columns: [siswa_id, pelajaran, nilai, jenis_kelamin, kelas]
Index: []

In [73]:
# <h2>Soal 3: Data Transformation</h2>

# lakukan data transformasi terhadap column 'nilai' dengan fungsi transformasi, berikut rumus dari normalisasi

# ![alt text](https://drive.google.com/uc?id=1wed-EbRSTA0JP1ceDp6lcKBqH2yJ4aa3)
dfnew=df.copy()
# display(dfnew)
def normalisasi(x):
    return (x-x.min())/(x.max()-x.min())
dfnew['nilai']=normalisasi(dfnew['nilai'])
display('setelah melakukan proses normalisasi: ',dfnew)

'setelah melakukan proses normalisasi: '

    siswa_id   pelajaran     nilai jenis_kelamin kelas
0          1      Fisika  0.134021     laki-laki   12C
1          2     Biologi  0.144330     laki-laki   12C
2          3     Geologi  0.556701     perempuan   12D
3          4     Biologi  0.000000     laki-laki   12D
4          5  Matematika  0.845361     perempuan   12C
5          6     Geologi  0.876289     perempuan   12B
6          7       Kimia  0.886598     perempuan   12B
7          8     Ekonomi  0.226804     laki-laki   12C
8          9       Kimia  0.030928     laki-laki   12C
9         10     Ekonomi  0.443299     laki-laki   12D
10        11     Biologi  0.216495     laki-laki   12B
11        12      Fisika  0.896907     perempuan   12B
12        13     Ekonomi  0.103093     perempuan   12B
13        14     Ekonomi  0.195876     laki-laki   12D
14        15     Geologi  0.958763     laki-laki   12C
15        16     Geologi  0.536082     perempuan   12D
16        17      Fisika  0.742268     laki-laki   12B
17        18      Fisika  0.061856     laki-laki   12C
18        19      Fisika  1.000000     perempuan   12D
19        20       Kimia  0.649485     laki-laki   12D